Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныСпециализаций</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУстановкиЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_ИсходнаяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_СоглашенияСтрахования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСертификата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специализации</Name>
					<Comment>Для целей расчета з/п</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_Прейскуранты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Прейскурант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_НоменклатураНаборов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВНаборе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОбщая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложенныйНабор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Набор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_Тарификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>омг_Тарификатор</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийУстановкиЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУстановкиЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦеныПрейскурантов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеныКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>омг_СтраховаяПрограмма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>омг_ЦеныНаборов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>омг_СтраховаяПрограммаНаборы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга, не хранится на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПараметровРасчетаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыПараметровРасчетаНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорияВыработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкаПоПрейскуранту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеТабеля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шкала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйПараметр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfCalculationTypes/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>Начисления</Name>
			<BaseCalculationTypes>
				<xr:Item>ChartOfCalculationTypes.Начисления</xr:Item>
			</BaseCalculationTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормулыРасчетаЗаработнойПлаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательРасчета1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательРасчета2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательРасчета3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПараметра1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПараметра2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПараметра3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностиВидовРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникБазыВторичногоНачисленияПоСтруктуре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ИспользуетсяПриоритизацияУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Омг_ЭтоПроцент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

Documents/УстановкаЦен/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте 
Перем мКэшВидовНоменклатуры;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);	
	Элементы.НоменклатураХарактеристикаНоменклатуры.Видимость = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВестиУчетПоХарактеристикам");
	
	УстановитьПодменюВыбораОпераций();
	
	// Изменено Макеев (
	Если Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.ЦеныКонтрагентов Тогда
		ДействияФормыДействиеУстановитьОперациюСервер("ЦеныКонтрагентов");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_ЦеныНаборов Тогда
		ДействияФормыДействиеУстановитьОперациюСервер("омг_ЦеныНаборов");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограмма Тогда
		ДействияФормыДействиеУстановитьОперациюСервер("омг_СтраховаяПрограмма");  
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы Тогда
		ДействияФормыДействиеУстановитьОперациюСервер("омг_СтраховаяПрограммаНаборы");
	// )
	Иначе
		ДействияФормыДействиеУстановитьОперациюСервер("ЦеныПрейскурантов");
	КонецЕсли;
	
	// Заполнить цены из прайса в новом документе, если номенклатура уже есть, но вся без цен.
	Если Объект.Ссылка.Пустая()
		И Объект.Номенклатура.Количество() <> 0
		И Объект.Номенклатура.Количество() = Объект.Номенклатура.НайтиСтроки(Новый Структура("Цена", 0))
	Тогда
		ОбъектКопия = Объект;
		ОперацияПерезаполнения("ПерезаполнитьПоПрейскуранту",ОбъектКопия,Объект.Прейскурант);	
		КопироватьДанныеФормы(ОбъектКопия, Объект);	
	КонецЕсли;
	
	УстановитьВидимостьЭлементов_ПриСозданииНаСервере();
	
	// Добавлено Макеев (
	Если Не Элементы.Найти("КнопкаФилиал") = Неопределено Тогда
		Элементы.КнопкаФилиал.Видимость = Ложь;
	КонецЕсли;
	Для Каждого ВыбФилиал Из Объект.омг_Филиалы Цикл
		омг_Филиалы.Добавить(ВыбФилиал.Филиал);
	КонецЦикла;
	//Если ЗначениеЗаполнено(Объект.Прейскурант) Тогда
	//	Если Объект.омг_Прейскуранты.НайтиСтроки(Новый Структура("Прейскурант", 
	//			Объект.Прейскурант)).Количество() = 0 Тогда
	//		омг_Прейскуранты.Добавить(Объект.Прейскурант);
	//	КонецЕсли;
	//КонецЕсли;
	Для Каждого ВыбПрейскурант Из Объект.омг_Прейскуранты Цикл
		омг_Прейскуранты.Добавить(ВыбПрейскурант.Прейскурант);
	КонецЦикла;
	Если Не Параметры.Ключ.Пустая() Или Не Параметры.ЗначениеКопирования.Пустая() Тогда
		омг_УстановитьПометкуЗаполненностиНабора(Объект);
	КонецЕсли;
	// )
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКэшВидовНоменклатуры(мКэшВидовНоменклатуры, Объект.Номенклатура);
	НастроитьВидимостьЭлементовСравнения();

	// Установим дату входящего документа на текущую.
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
			Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЦен.ЦеныПрейскурантов");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Истина // ИспользоватьПодключаемоеОборудование Проверка на включенную ФО "Использовать ВО"
	   И МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО.
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	
	КонецЕсли;

	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект, Истина, ЭтаФорма);

	// Добавлено Макеев (
	омг_УстановитьПометкуЗаполненностиНабора(Объект);
	// )
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// МеханизмВнешнегоОборудования
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	// Конец МеханизмВнешнегоОборудования
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" Тогда
		Если ВводДоступен() Тогда
			ТипШК = Неопределено;
			РаботаСТорговымОборудованиемКлиент.ОбработатьСобытиеСШКФормы(ЭтаФорма, Параметр, ТипШК);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ДействияФормыДействиеУстановитьОперацию(Команда)
	Если Команда <> Неопределено Тогда
		ДействияФормыДействиеУстановитьОперациюСервер(Команда.Имя);
		Если Команда.Имя = "омг_СтраховаяПрограммаНаборы" Тогда
			Элементы.Номенклатураомг_СоглашенияСтрахования.Видимость = Истина
		иначе
			Элементы.Номенклатураомг_СоглашенияСтрахования.Видимость = Ложь
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоГруппе_ПослеВыбораГруппы", ЭтотОбъект);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораГруппыУпр",, ЭтотОбъект,,,, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппе_ПослеВыбораГруппы(Группа, ДополнительныеПараметры) Экспорт
	
	Если Группа <> Неопределено Тогда
		ОбъектКопия = Объект;
		ОперацияПерезаполнения("ДобавитьНоменклатуруВДокументПоГруппе", ОбъектКопия,,,Группа, Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения);
		КопироватьДанныеФормы(ОбъектКопия, Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦены(Команда)
	
	СтруктураТЧ = СформироватьСтруктуруТЧ();
	ПараметрыФормы = Новый Структура("ДокументСсылка,ДанныеДокумента", Объект.Ссылка, СтруктураТЧ);
	
	Оповещение = Новый ОписаниеОповещения("ИзменитьЦеныЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ФормированиеЦен.Форма", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦеныЗавершение(ЗначениеОтОбработки, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеОтОбработки <> Неопределено Тогда
		ОбновитьТабличнуюЧасть(ЗначениеОтОбработки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеКнопкиМенюЗаполнения(Команда)
	
	ИмяКоманды = Команда.Имя;
	
	ПараметрыОперации = Новый Структура("ИмяКоманды", ИмяКоманды);
	
	// Прейскурант актуален для некоторых операций
	Если 	ИмяКоманды = "ПерезаполнитьПоПрейскурантуДокумента"
		Или ИмяКоманды = "ДополнитьИзПрейскурантаДокумента"
		Или ИмяКоманды = "ОчиститьИЗаполнитьИзПрейскурантаДокумента"
		Или ИмяКоманды = "ДополнитьПоОстаткамНаСкладе"
	Тогда
		Прейскурант = Объект.Прейскурант;
		
	ИначеЕсли ИмяКоманды = "ПерезаполнитьПоДругомуПрейскуранту"
		Или	  ИмяКоманды = "ДополнитьИзДругогоПрейскуранта"
		Или   ИмяКоманды = "ОчиститьИЗаполнитьИзДругогоПрейскуранта"
	Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьНажатиеКнопкиМенюЗаполнения_ПослеОпределенияПрейскуранта", ЭтотОбъект, ПараметрыОперации); 
		ОткрытьФорму("Справочник.Прейскуранты.ФормаВыбора",, ЭтотОбъект,,,, Оповещение);
		
	Иначе
		Прейскурант = Null; // Уникальное пустое значение.
	КонецЕсли;
	
	ОбработатьНажатиеКнопкиМенюЗаполнения_ПослеОпределенияПрейскуранта(Прейскурант, ПараметрыОперации);
	
КонецПроцедуры

// Если Прейскурант не используется в операции, то передается пустое значение, отличное от Неопределено
&НаКлиенте
Процедура ОбработатьНажатиеКнопкиМенюЗаполнения_ПослеОпределенияПрейскуранта(Прейскурант = Null, ПараметрыОперации) Экспорт
	
	Если Прейскурант = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации.Вставить("Прейскурант", Прейскурант);
	
	ИмяКоманды = ПараметрыОперации.ИмяКоманды;
		
	Если	ИмяКоманды = "ДополнитьПоОстаткамНаСкладе"
			Или ИмяКоманды = "ДополнитьПоОстаткамНаСкладеВУчетныхЦенах"
	Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьНажатиеКнопкиМенюЗаполнения_ПослеОпределенияСклада", ЭтотОбъект, ПараметрыОперации); 
		ОткрытьФорму("Справочник.Склады.ФормаВыбора",, ЭтотОбъект,,,, Оповещение);
	КонецЕсли;
	
	ОбработатьНажатиеКнопкиМенюЗаполнения_ПослеОпределенияСклада(, ПараметрыОперации);
	
КонецПроцедуры

// Если Склад не используется в операции, то передается пустое значение, отличное от Неопределено
&НаКлиенте
Процедура ОбработатьНажатиеКнопкиМенюЗаполнения_ПослеОпределенияСклада(Склад = Null, ПараметрыОперации) Экспорт
	
	Если Склад = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Прейскурант	= ПараметрыОперации.Прейскурант;
	ИмяКоманды	= ПараметрыОперации.ИмяКоманды;
	
	// Начало выполнения операции
	ОбъектКопия = Объект;
	
	Если ИмяКоманды = "ПерезаполнитьПоПрейскурантуДокумента" Тогда
		ОперацияПерезаполнения("ПерезаполнитьПоПрейскуранту", ОбъектКопия, Объект.Прейскурант,,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения);
		
	ИначеЕсли ИмяКоманды = "ПерезаполнитьПоДругомуПрейскуранту" Тогда
		ОперацияПерезаполнения("ПерезаполнитьПоПрейскуранту", ОбъектКопия, Прейскурант,,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения);
		
	ИначеЕсли ИмяКоманды = "ПерезаполнитьПоЦенамПоступления" Тогда
		ОперацияПерезаполнения("ПерезаполнитьПоЦенамПоступления", ОбъектКопия);
		
	ИначеЕсли ИмяКоманды = "ДополнитьИзПрейскурантаДокумента" Тогда
		ОперацияПерезаполнения("ДополнитьИзПрейскуранта", ОбъектКопия, Объект.Прейскурант,,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения);
		
	ИначеЕсли ИмяКоманды = "ДополнитьИзДругогоПрейскуранта" Тогда
		ОперацияПерезаполнения("ДополнитьИзПрейскуранта", ОбъектКопия, Прейскурант,,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения);
		
	ИначеЕсли ИмяКоманды = "ДополнитьИзДокументовПоступления" Тогда
		ОперацияПерезаполнения("ДополнитьИзДокументовПоступления", ОбъектКопия,,,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения);
		
	ИначеЕсли ИмяКоманды = "ОчиститьИЗаполнитьИзПрейскурантаДокумента" Тогда
		Очистить = Истина;
		ОперацияПерезаполнения("ДополнитьИзПрейскуранта", ОбъектКопия, Объект.Прейскурант, Очистить,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения);
		
	ИначеЕсли ИмяКоманды = "ОчиститьИЗаполнитьИзДругогоПрейскуранта" Тогда
		Очистить = Истина;
		ОперацияПерезаполнения("ДополнитьИзПрейскуранта", ОбъектКопия, Прейскурант, Очистить,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения);
		
	ИначеЕсли ИмяКоманды = "ОчиститьИЗаполнитьИзДокументовПоступления" Тогда
		Очистить = Истина;
		ОперацияПерезаполнения("ДополнитьИзДокументовПоступления", ОбъектКопия,, Очистить,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения);
		
	ИначеЕсли ИмяКоманды = "ДополнитьПоОстаткамНаСкладе" Тогда
		ОперацияПерезаполнения("ДополнитьПоОстаткамНаСкладе", ОбъектКопия, Прейскурант,,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения, Склад);	
		
	ИначеЕсли ИмяКоманды = "ДополнитьПоОстаткамНаСкладеВУчетныхЦенах" Тогда
		ОперацияПерезаполнения("ДополнитьПоОстаткамНаСкладеВУчетныхЦенах", ОбъектКопия, Прейскурант,,,Элементы.Сравнить.Пометка, ПрейскурантСравнения, ДатаСравнения, Склад);	
	КонецЕсли;
	
	КопироватьДанныеФормы(ОбъектКопия, Объект);

	ЗаполнитьКэшВидовНоменклатуры(мКэшВидовНоменклатуры, Объект.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура Сравнить(Команда)
	Элементы.Сравнить.Пометка = НЕ Элементы.Сравнить.Пометка;
	НастроитьВидимостьЭлементовСравнения();
	ПерезаполнитьЦеныСравнения();
КонецПроцедуры

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НоменклатураПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Номенклатура.ТекущийЭлемент = Элементы.НоменклатураЕдиницаИзмерения Тогда
		Элементы.НоменклатураЕдиницаИзмерения.ТолькоПросмотр = 
			мКэшВидовНоменклатуры.Получить(Элементы.Номенклатура.ТекущиеДанные.Номенклатура) <> ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элементы.Номенклатура.ТекущийЭлемент <> Элементы.НоменклатураЕдиницаИзмерения Тогда
		Элементы.НоменклатураЕдиницаИзмерения.ТолькоПросмотр = 
			мКэшВидовНоменклатуры.Получить(Элементы.Номенклатура.ТекущиеДанные.Номенклатура) <> ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал");
	КонецЕсли;
	
	// Добавлено Макеев (
	//Если Копирование Тогда
	//	Элементы.Номенклатура.ТекущаяСтрока.омг_НаборУстановлен = Ложь;
	//КонецЕсли;
	// )
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Номенклатура.ТекущиеДанные;
	ТекущаяСтрока.ЕдиницаИзмерения = Ценообразование.ПолучитьЕдиницуПродажиНоменклатуры(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ЕдиницаИзмерения);
	
	// Добавление номенклатуры в кэш видов номенклатуры.
	ВидНоменклатуры = мКэшВидовНоменклатуры.Получить(ТекущаяСтрока.Номенклатура);
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = ?(ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмерения), 
							ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал"), 
							ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуга"));
							
		мКэшВидовНоменклатуры.Вставить(ТекущаяСтрока.Номенклатура, ВидНоменклатуры);
		
	КонецЕсли;
	
	Элементы.НоменклатураЕдиницаИзмерения.ТолькоПросмотр = 
		ВидНоменклатуры <> ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал");
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Номенклатура.ТекущиеДанные;
	ВидНоменклатуры = мКэшВидовНоменклатуры.Получить(ТекущаяСтрока.Номенклатура);
	Если ВидНоменклатуры <> ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал") Тогда
		СтандартнаяОбработка = Ложь;
		ТекущаяСтрока.ЕдиницаИзмерения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияПриИзменении(Элемент)
	Элементы.ПрейскурантСравнения.Доступность = (ВидСравнения = "Прейскурант");
	Элементы.ДатаСравнения.Доступность = (ВидСравнения = "Прейскурант");
	Если ВидСравнения <> "Прейскурант" Тогда
		ПрейскурантСравнения = ПредопределенноеЗначение("Справочник.Прейскуранты.ПустаяСсылка");
		ДатаСравнения = '00010101';
	КонецЕсли;
	ПерезаполнитьЦеныСравнения();
КонецПроцедуры

&НаКлиенте
Процедура ПрейскурантСравненияПриИзменении(Элемент)
	ПерезаполнитьЦеныСравнения();
КонецПроцедуры

&НаКлиенте
Процедура ДатаСравненияПриИзменении(Элемент)
	ПерезаполнитьЦеныСравнения();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Разница   = ТекущиеДанные.Цена - ТекущиеДанные.СравниваемаяЦена;
		ТекущиеДанные.Отношение = ?(ТекущиеДанные.СравниваемаяЦена = 0, 0, ТекущиеДанные.Цена/ТекущиеДанные.СравниваемаяЦена*100);	
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьКэшВидовНоменклатуры(КэшВидовНоменклатуры, Знач ОбъектНоменклатура)
	
	КэшВидовНоменклатуры = Новый Соответствие;
	Если ОбъектНоменклатура.Количество() <> 0 Тогда
		НоменклатураДокумента = ОбъектНоменклатура.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НоменклатураДокумента", НоменклатураДокумента);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&НоменклатураДокумента)"
		;
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			КэшВидовНоменклатуры.Вставить(Выб.Номенклатура, Выб.ВидНоменклатуры);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов_ПриСозданииНаСервере()
	
	// Видимость закладки "Сертификаты"
	Если Объект.Сертификаты.Количество() = 0
		И УправлениеНастройками.ПараметрУчета("ИспользоватьСертификаты") <> Истина
	Тогда
		Элементы.Сертификаты.Видимость = Ложь;
	КонецЕсли;
	
	// Видимость закладки "Специализации (для з/п)" - скрывать, если нет ни одного вида начисления с оценкой по прейскуранту.
	Если Объект.Специализации.Количество() = 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Оценка", Перечисления.ВидыПараметровРасчетаНачислений.ОценкаПоПрейскуранту);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Начисления.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	(Начисления.ВидПараметра1 = &Оценка
		|			ИЛИ Начисления.ВидПараметра2 = &Оценка
		|			ИЛИ Начисления.ВидПараметра3 = &Оценка)
		|	И Начисления.ПометкаУдаления = ЛОЖЬ"
		;
		Если Запрос.Выполнить().Пустой() Тогда
			Элементы.Специализации.Видимость = Ложь;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// ЗАПОЛНЕНИЕ СПИСКА ОПЕРАЦИЙ.
&НаСервере
Процедура УстановитьПодменюВыбораОпераций()
	
	МассивТипов = Перечисления.ВидыОперацийУстановкиЦен.ПустаяСсылка().Метаданные().ЗначенияПеречисления;
	// Добавлено Макее (
	Если РольДоступна("омг_УстановкаЦенПоСтраховымПрограммам") Тогда
		НовыйМассивТипов = Новый Массив;
		НовыйМассивТипов.Добавить(МассивТипов.омг_СтраховаяПрограмма);
		НовыйМассивТипов.Добавить(МассивТипов.омг_СтраховаяПрограммаНаборы);
		МассивТипов = НовыйМассивТипов;
	КонецЕсли;
	// )
	РаботаСДиалогамиСервер.УстановитьПодменюОперации(МассивТипов, ЭтаФорма, "Подключаемый_ДействияФормыДействиеУстановитьОперацию");
	
КонецПроцедуры

&НаСервере
Процедура ДействияФормыДействиеУстановитьОперациюСервер(КомандаИмя)
	
	Если ЗначениеЗаполнено(КомандаИмя) Тогда 
		Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен[КомандаИмя];
	КонецЕсли;
	
	// Установить тип значения поля ввода.
	// Изменено Макеев (
	Если Не Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен[КомандаИмя] Тогда
		омг_Прейскуранты.Очистить();
		Объект.омг_Прейскуранты.Очистить();
	КонецЕсли;
	Если Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.ЦеныКонтрагентов Тогда
		ОграничениеТипа	= Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_ЦеныНаборов Тогда
		ОграничениеТипа	= Новый ОписаниеТипов("СправочникСсылка.Прейскуранты");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограмма Тогда
		ОграничениеТипа	= Новый ОписаниеТипов("СправочникСсылка.СоглашенияСтрахования");  
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы Тогда
		ОграничениеТипа	= Новый ОписаниеТипов("СправочникСсылка.СоглашенияСтрахования");
	// )
	Иначе
		ОграничениеТипа	= Новый ОписаниеТипов("СправочникСсылка.Прейскуранты");
	КонецЕсли;
	
	// Добавлено Макеев (
	Если Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.ЦеныПрейскурантов Тогда
		Элементы.Прейскурант.Заголовок = "Прейскурант";
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_ЦеныНаборов Тогда
		Элементы.Прейскурант.Заголовок = "Прейскурант";  
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы Тогда
		Элементы.Прейскурант.Заголовок = "Страховая программа (наборы)";	
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.ЦеныКонтрагентов Тогда
		Элементы.Прейскурант.Заголовок = "Контрагент";
	Иначе
		Элементы.Прейскурант.Заголовок = "Страховая программа";
	КонецЕсли;
	
	УстановкаЦенНаборов = Ложь;
	//УстановкаЦенНаборов = Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_ЦеныНаборов;	
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_ЦеныНаборов или 
		Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы Тогда  
		УстановкаЦенНаборов = Истина
	КонецЕсли;

	Элементы.Номенклатураомг_НоменклатураНабора.Видимость = УстановкаЦенНаборов;
	Элементы.Номенклатураомг_Коэффициент.Видимость = Не УстановкаЦенНаборов;
	Элементы.Номенклатураомг_ИсходнаяЦена.Видимость = Не УстановкаЦенНаборов;
	Элементы.НоменклатураЦена.ТолькоПросмотр = УстановкаЦенНаборов;
	Если УстановкаЦенНаборов Тогда
		Элементы.НоменклатураНоменклатура.Заголовок = "Набор";
		НовыеПараметрыВыбора = Новый Массив;
		НовыеПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Набор));
		Элементы.НоменклатураНоменклатура.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметрыВыбора);
		Элементы.ГруппаНоменклатура.Заголовок = "Номенклатура (наборы услуг)";
		Элементы.НоменклатураЦена.Заголовок = "Цена";
	Иначе
		Элементы.НоменклатураНоменклатура.Заголовок = "Материал/Работа";
		НовыеПараметрыВыбора = Новый Массив;
		ВидыНоменклатуры = Новый Массив;
		ВидыНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Материал);
		ВидыНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Услуга);
		НовыеПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", ВидыНоменклатуры));
		Элементы.НоменклатураНоменклатура.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметрыВыбора);
		Элементы.ГруппаНоменклатура.Заголовок = "Номенклатура (услуги, товарно-материальные ценности)";
		Элементы.НоменклатураЦена.Заголовок = "Цена с коэф.";
	КонецЕсли;
	// )
	ЭУПрейскурант	=	 Элементы.Прейскурант;
	ЭУПрейскурант.ОграничениеТипа = ОграничениеТипа;
	
	мПрейскурант = ОграничениеТипа.ПривестиЗначение(Объект.Прейскурант);
	Если Объект.Прейскурант <> мПрейскурант Тогда
		Объект.Прейскурант = мПрейскурант;
	КонецЕсли;
	
	// Изменено Макеев (
	ЭУПрейскурант.АвтоОтметкаНезаполненного	= Объект.ВидОперации <> Перечисления.ВидыОперацийУстановкиЦен.ЦеныКонтрагентов
		И Объект.ВидОперации <> Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограмма;
	// )
	ЭУПрейскурант.ОтметкаНезаполненного		= ЭУПрейскурант.АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(Объект.Прейскурант);
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект.Ссылка, Истина, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруТЧ()
	массивВозвратаСтрок = новый Массив;
	Для каждого СтрокаОбъекта из Объект.Номенклатура Цикл
		СтруктураСтроки = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Цена");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,СтрокаОбъекта);
		массивВозвратаСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;
	Возврат массивВозвратаСтрок;
КонецФункции

&НаСервере
Процедура ОбновитьТабличнуюЧасть(МассивСтруктур)
	ТабличнаяЧасть = Объект.Номенклатура;	
	ТабличнаяЧасть.Очистить();           	
	Для Каждого Элемент Из МассивСтруктур Цикл		
		НоваяСтрока = ТабличнаяЧасть.Добавить();		
		НоваяСтрока.Номенклатура = Элемент.Номенклатура;		
		НоваяСтрока.ХарактеристикаНоменклатуры = Элемент.ХарактеристикаНоменклатуры;		
		НоваяСтрока.ЕдиницаИзмерения = Элемент.ЕдиницаИзмерения;                    		
		НоваяСтрока.Цена = Элемент.Цена;                                            		
	КонецЦикла;
	Если Элементы.Сравнить.Пометка Тогда
		ПерезаполнитьЦеныСравнения();	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьЦеныПоступления()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДатыПоследнихПоступлений.Номенклатура,
	|	ДатыПоследнихПоступлений.ХарактеристикаНоменклатуры,
	|	ДатыПоследнихПоступлений.ЕдиницаИзмерения,
	|	Товары.Цена
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(Товары.Ссылка.Дата) КАК Дата,
	|		Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|	ИЗ
	|		Документ.%Док%.Товары КАК Товары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|			ПО Товары.Номенклатура = СпрНом.Ссылка
	|	ГДЕ
	|		Товары.Ссылка.Дата <= &Дата
	|		И Товары.Ссылка.Проведен
	|		И НЕ Товары.Номенклатура.ПометкаУдаления
	|		И НЕ Товары.Номенклатура.Архив
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Товары.Номенклатура,
	|		Товары.ХарактеристикаНоменклатуры,
	|		Товары.ЕдиницаИзмерения) КАК ДатыПоследнихПоступлений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.%Док%.Товары КАК Товары
	|		ПО ДатыПоследнихПоступлений.Дата = Товары.Ссылка.Дата
	|			И ДатыПоследнихПоступлений.Номенклатура = Товары.Номенклатура
	|			И ДатыПоследнихПоступлений.ХарактеристикаНоменклатуры = Товары.ХарактеристикаНоменклатуры
	|			И ДатыПоследнихПоступлений.ЕдиницаИзмерения = Товары.ЕдиницаИзмерения";	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%Док%", "ПоступлениеТоваровУслуг");
	РезПоступления = Запрос.Выполнить();
	
	Если РезПоступления.Пустой() Тогда
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%Док%", "ОприходованиеТоваров");
		РезОприходования = Запрос.Выполнить();
		
		Если РезОприходования.Пустой() Тогда
			Возврат Неопределено;
		Иначе
			ТЗ = РезОприходования.Выгрузить();
		КонецЕсли;
	Иначе
		ТЗ = РезПоступления.Выгрузить();
	КонецЕсли;
	
	Возврат ТЗ;	
КонецФункции

&НаСервере
Процедура ПерезаполнитьЦеныСравненияПоПрейскурантуНаДатуСервер(Прейскурант, Дата)
	Для Каждого СТР Из Объект.Номенклатура Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Прейскурант",                Прейскурант);
		Отбор.Вставить("Номенклатура",               СТР.Номенклатура);
		Отбор.Вставить("ХарактеристикаНоменклатуры", СТР.ХарактеристикаНоменклатуры);
		Отбор.Вставить("ЕдиницаИзмерения",           СТР.ЕдиницаИзмерения);	
		Цены  = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(?(Дата = '00010101', Объект.Дата, Дата), Отбор);
		Если Цены.Количество() = 0 Тогда
			СТР.СравниваемаяЦена = 0;
			СТР.Разница          = 0;
			СТР.Отношение        = 0;
			Продолжить;	
		КонецЕсли;
		ЦенаПрейскуранта = Цены[0].Цена;
		Если СТР.СравниваемаяЦена <> ЦенаПрейскуранта Тогда
			СТР.СравниваемаяЦена = ЦенаПрейскуранта;
			СТР.Разница          = СТР.Цена - СТР.СравниваемаяЦена;
			СТР.Отношение        = ?(СТР.СравниваемаяЦена = 0, 0, СТР.Цена/СТР.СравниваемаяЦена*100);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦеныСравненияПоПоследнемуПоступлениюСервер()
	ЦеныПоступления = ПолучитьЦеныПоступления();
	Для Каждого СТР Из Объект.Номенклатура Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",               СТР.Номенклатура);
		Отбор.Вставить("ХарактеристикаНоменклатуры", СТР.ХарактеристикаНоменклатуры);
		Отбор.Вставить("ЕдиницаИзмерения",           СТР.ЕдиницаИзмерения);
		
		ТЗ = ЦеныПоступления.НайтиСтроки(Отбор);
		Если ТЗ.Количество() = 0 Тогда
			СТР.СравниваемаяЦена = 0;
			СТР.Разница          = 0;
			СТР.Отношение        = 0;
			Продолжить;	
		КонецЕсли;
		
		Цена = ТЗ[0].Цена;
		Если СТР.СравниваемаяЦена <> Цена Тогда
			СТР.СравниваемаяЦена = Цена;
			СТР.Разница          = СТР.Цена - СТР.СравниваемаяЦена;
			СТР.Отношение        = ?(СТР.СравниваемаяЦена = 0, 0, СТР.Цена/СТР.СравниваемаяЦена*100);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьЭлементовСравнения()
	СравнениеВключено = Элементы.Сравнить.Пометка;
	Элементы.ПараметрыСравнения.Видимость = СравнениеВключено;
	Элементы.ПрейскурантСравнения.Доступность = (ВидСравнения = "Прейскурант");
	Элементы.ДатаСравнения.Доступность        = (ВидСравнения = "Прейскурант");
	Элементы.НоменклатураСравниваемаяЦена.Видимость = СравнениеВключено;
	Элементы.НоменклатураРазница.Видимость = СравнениеВключено;
	Элементы.НоменклатураОтношение.Видимость = СравнениеВключено;
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦеныСравнения()
	ОчиститьЦеныСравнения();
	Если ВидСравнения = "Прейскурант" И ЗначениеЗаполнено(ПрейскурантСравнения) Тогда
		ПерезаполнитьЦеныСравненияПоПрейскурантуНаДатуСервер(ПрейскурантСравнения, ДатаСравнения);		
	ИначеЕсли ВидСравнения = "Поступление" Тогда
		ПерезаполнитьЦеныСравненияПоПоследнемуПоступлениюСервер();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОчиститьЦеныСравнения()
	Для каждого СТР Из Объект.Номенклатура Цикл
		СТР.СравниваемаяЦена = 0;
		СТР.Разница          = 0;
		СТР.Отношение        = 0;
	КонецЦикла; 
КонецПроцедуры 

// Обработка изменения реквизитов документа.
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. 
// 									  Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
// 										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
&НаКлиенте
Функция ОбработкаРеквизитаУпр(Имя, ТекСтрока=Неопределено, ЭтаФорма=Неопределено, ДопПараметры=Неопределено)

	Если Имя="Номенклатура" Тогда		
		Если Не ЗначениеЗаполнено(ТекСтрока.Цена) Тогда
			ТекСтрока.Цена = ПолучитьЦенуПозиции(ТекСтрока.Номенклатура,ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения,Объект.Прейскурант);
		КонецЕсли;
	ИначеЕсли Имя="Сертификаты" Тогда
		Если Не ЗначениеЗаполнено(ТекСтрока.Цена) Тогда
			ТекСтрока.Цена = ПолучитьЦенуПозиции(ТекСтрока.ВидСертификата,,,Объект.Прейскурант);
		КонецЕсли;
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

&НаСервереБезКонтекста
Функция ПолучитьЦенуПозиции(Номенклатура, ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено, Прейскурант)
	
	Если ЗначениеЗаполнено(Прейскурант) Тогда
		СтруктураЦен = Ценообразование.ПолучитьЦену(Прейскурант, Номенклатура, , ХарактеристикаНоменклатуры, ЕдиницаИзмерения);
	Иначе
		Возврат 0;
	КонецЕсли;
	
	Возврат СтруктураЦен.Цена;
	
КонецФункции

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Функция осуществляет обработку считывания штрихкода номенклатуры.
//
// Параметры:
//  ДанныеНоменклатуры	 - Структура	 - сведения о считанной позиции.
//  СШК					 - Строка		 - Идентификатор сканера штрих-кода, с которым связано данное событие.
// 
// Возвращаемое значение:
//  Булево - Событие обработано.
//
&НаКлиенте
Функция СШКНоменклатура(ДанныеНоменклатуры, СШК) Экспорт
	Номенклатура				= ДанныеНоменклатуры.Номенклатура;
	ХарактеристикаНоменклатуры	= ДанныеНоменклатуры.ХарактеристикаНоменклатуры;
	Единица						= ДанныеНоменклатуры.ЕдиницаИзмерения;
	
	Если ХарактеристикаНоменклатуры = Неопределено Тогда
		ХарактеристикаНоменклатуры = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"); 
	КонецЕсли;	
	СерияНоменклатуры = ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка");
	вид = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал");
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		ВидНом = Номенклатура.ВидНоменклатуры;
	#Иначе
		ВидНом = ДопСерверныеФункции.ПолучитьРеквизит(Номенклатура,"ВидНоменклатуры"); 
	#КонецЕсли
	
	Если ВидНом = вид Тогда
		ТабличнаяЧасть	= Объект.Номенклатура;
		мсСтрокиТовары = ТабличнаяЧасть.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения",Номенклатура, ХарактеристикаНоменклатуры, Единица));
		
		Если мсСтрокиТовары.Количество() = 0 Тогда
			
			// Добавление новой строки
			СтрокаТЧ = ТабличнаяЧасть.Добавить();
			СтрокаТЧ.Номенклатура = Номенклатура;     
			СтрокаТЧ.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;      
			СтрокаТЧ.ЕдиницаИзмерения = Единица;
			
			НомерСтроки = СтрокаТЧ.НомерСтроки - 1;
			ОбработкаРеквизитаУпр("Номенклатура", Объект.Номенклатура[НомерСтроки], ЭтаФорма);
			НоваяСтрока = Истина;
		КонецЕсли;		
	Иначе
		ТекстПредупреждения = НСтр("ru='Номенклатура %1 не является материалом. Допускается только подбор номенклатуры материалов.'"); 
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения, Строка(Номенклатура)); 
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаНоменклатура;
	Возврат Истина;
	
КонецФункции // СШКНоменклатура()

&НаКлиенте
Функция СШКСертификат(Сертификат, СШК) Экспорт
	
	ВидСертификата = ДопСерверныеФункции.ПолучитьРеквизит(Сертификат, "ВидСертификата");
	
	СтрокиЦен = Объект.Сертификаты.НайтиСтроки(Новый Структура("ВидСертификата",ВидСертификата));
	Если СтрокиЦен.Количество() = 0 Тогда
		// Добавление новой строки
		СтрокаТЧ = Объект.Сертификаты.Добавить();
		СтрокаТЧ.ВидСертификата = ВидСертификата;     
		
		НомерСтроки = СтрокаТЧ.НомерСтроки - 1;
		ОбработкаРеквизитаУпр("Сертификаты", Объект.Сертификаты[НомерСтроки], ЭтаФорма);
		НоваяСтрока = Истина;	
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСертификаты;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОперацияПерезаполнения (ПроцедураЗаполнения, Объект, Прейскурант = Неопределено, Очистить = Ложь, Группа = Неопределено, ПометкаСравнить = Ложь, ПрейскурантСравнения = Неопределено, ДатаСравнения = Неопределено, Склад = Неопределено)
	
	Если ПроцедураЗаполнения = "ДополнитьИзПрейскуранта" Тогда
		Документы.УстановкаЦен.ДополнитьИзПрейскуранта(Объект, Прейскурант, Очистить);
	ИначеЕсли ПроцедураЗаполнения = "ПерезаполнитьПоПрейскуранту"  Тогда
		Документы.УстановкаЦен.ПерезаполнитьПоПрейскуранту(Объект, Прейскурант);
	ИначеЕсли ПроцедураЗаполнения = "ПерезаполнитьПоЦенамПоступления" Тогда
		Документы.УстановкаЦен.ПерезаполнитьПоЦенамПоступления(Объект);
	ИначеЕсли ПроцедураЗаполнения = "ДополнитьИзДокументовПоступления" Тогда
		Документы.УстановкаЦен.ДополнитьИзДокументовПоступления(Объект, Очистить);
	ИначеЕсли ПроцедураЗаполнения = "ДобавитьНоменклатуруВДокументПоГруппе" Тогда
		Документы.УстановкаЦен.ДобавитьНоменклатуруВДокументПоГруппе(Объект, Группа);
	ИначеЕсли ПроцедураЗаполнения = "ДополнитьПоОстаткамНаСкладе" Тогда
		Документы.УстановкаЦен.ДополнитьПоОстаткамНаСкладе(Объект, Склад);
	ИначеЕсли ПроцедураЗаполнения = "ДополнитьПоОстаткамНаСкладеВУчетныхЦенах" Тогда
		Документы.УстановкаЦен.ДополнитьПоОстаткамНаСкладеВУчетныхЦенах(Объект, Склад);
	КонецЕсли;
	Если ПометкаСравнить Тогда
		Документы.УстановкаЦен.ПерезаполнитьЦеныСравнения(Объект, ПрейскурантСравнения, ДатаСравнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбранных = омг_Филиалы;
	Отбор = Новый Структура("Организация", Объект.омг_Организация);
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "Филиалы", СписокВыбранных, Отбор), Элементы.омг_Филиалы,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПерезаполнитьТаблицуФилиалов(СписокФилиалов)
	
	Объект.омг_Филиалы.Очистить();
	Для Каждого ВыбФилиал Из СписокФилиалов Цикл
		Объект.омг_Филиалы.Добавить().Филиал = ВыбФилиал.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Модифицированность = Истина;
	омг_ПерезаполнитьТаблицуФилиалов(ВыбранноеЗначение);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоэффициентОрганизации(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ТарификаторСрезПоследних.Организация КАК Организация,
	               |	омг_ТарификаторСрезПоследних.Коэффициент КАК Коэффициент
	               |ИЗ
	               |	РегистрСведений.омг_Тарификатор.СрезПоследних(&Дата, Организация = &Организация) КАК омг_ТарификаторСрезПоследних";
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Коэффициент;
	
КонецФункции

&НаКлиенте
Процедура Номенклатураомг_ИсходнаяЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Номенклатура.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.омг_ИсходнаяЦена * СтрокаТабличнойЧасти.омг_Коэффициент / 100 + СтрокаТабличнойЧасти.омг_ИсходнаяЦена;
	
КонецПроцедуры

&НаКлиенте
Процедура Номенклатураомг_КоэффициентПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Номенклатура.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.омг_ИсходнаяЦена * СтрокаТабличнойЧасти.омг_Коэффициент / 100 + СтрокаТабличнойЧасти.омг_ИсходнаяЦена;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция омг_ОтобратьФилиалыПоОрганизации(Знач Филиалы, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Филиалы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Филиалы КАК Филиалы
	               |ГДЕ
	               |	Филиалы.Ссылка В(&Филиалы)
	               |	И Филиалы.Организация = &Организация";
	РезультатЗапроса = Запрос.Выполнить();
	Филиалы.Очистить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Филиалы;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Филиалы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Филиалы;
	
КонецФункции

&НаКлиенте
Процедура омг_ОрганизацияПриИзменении(Элемент)
	
	омг_Филиалы = омг_ОтобратьФилиалыПоОрганизации(омг_Филиалы, Объект.омг_Организация);
	омг_ПерезаполнитьТаблицуФилиалов(омг_Филиалы);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПерезаполнитьТаблицуПрейскурантов(СписокПрейскурантов)
	
	Объект.омг_Прейскуранты.Очистить();
	Для Каждого ВыбПрейскурантов Из СписокПрейскурантов Цикл
		Объект.омг_Прейскуранты.Добавить().Прейскурант = ВыбПрейскурантов.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПрейскурантНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбранных = омг_Прейскуранты;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограмма") 
		Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы") Тогда
		Отбор = Новый Структура("Организация", Объект.омг_Организация);
		
		ПараметрыЗапроса = Новый Массив;
		ПараметрыЗапроса.Добавить(Новый Структура("Параметр, Значение", "Дата", Объект.Дата));
		
		Отбор.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
		
		СложныеОтборы = Новый Массив;
		СложныеОтборы.Добавить("&Дата МЕЖДУ ДатаНачала И ДатаОкончания");
		
		Отбор.Вставить("СложныеОтборы", СложныеОтборы);
		ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
			Новый Структура("Справочник, СписокВыбранных, Отбор", "СоглашенияСтрахования", СписокВыбранных, Отбор), Элементы.Прейскурант,
			УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЦен.ЦеныПрейскурантов")
			Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЦен.омг_ЦеныНаборов") 
			Тогда
		//Отбор = Новый Структура("омг_Организация", Объект.омг_Организация);
		ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
			Новый Структура("Справочник, СписокВыбранных", "Прейскуранты", СписокВыбранных), Элементы.Прейскурант,
			УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
			Новый Структура("Справочник, СписокВыбранных", "Контрагенты", СписокВыбранных), Элементы.Прейскурант,
			УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПрейскурантОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Модифицированность = Истина;
	омг_ПерезаполнитьТаблицуПрейскурантов(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Функция омг_ЗагрузитьЦеныПоТарификторуНаСервере(ДвоичныеДанные, Начало, Конец, Расширение)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла);
	
	Объект.Номенклатура.Очистить();
	
	ТаблицаАртикулов = Новый ТаблицаЗначений;
	ТаблицаАртикулов.Колонки.Добавить("Артикул", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаАртикулов.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаАртикулов.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаАртикулов.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	
	Для НСтроки = Начало По ?(Конец = 0, ТабличныйДокумент.ВысотаТаблицы, Конец) Цикл
		
		СтрокаТаблицы = ТаблицаАртикулов.Добавить();
		СтрокаТаблицы.Артикул = СокрЛП(ТабличныйДокумент.Область(НСтроки, 1, НСтроки, 1).Текст);
		СтрокаТаблицы.Наименование = СокрЛП(ТабличныйДокумент.Область(НСтроки, 2, НСтроки, 2).Текст);
		СтрокаТаблицы.Цена = СокрЛП(ТабличныйДокумент.Область(НСтроки, 7, НСтроки, 7).Текст);
		СтрокаТаблицы.НомерСтроки = НСтроки;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ТарификаторСрезПоследних.Период КАК Период,
	               |	омг_ТарификаторСрезПоследних.Организация КАК Организация,
	               |	омг_ТарификаторСрезПоследних.Коэффициент КАК Коэффициент
	               |ПОМЕСТИТЬ ВТ_Коэффициент
	               |ИЗ
	               |	РегистрСведений.омг_Тарификатор.СрезПоследних(&Дата, Организация = &Организация) КАК омг_ТарификаторСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаАртикулов.Артикул КАК Артикул,
	               |	ТаблицаАртикулов.Наименование КАК Наименование,
	               |	ТаблицаАртикулов.Цена КАК Цена,
	               |	ТаблицаАртикулов.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_ТаблицаАртикулов
	               |ИЗ
	               |	&ТаблицаАртикулов КАК ТаблицаАртикулов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаАртикулов.Артикул КАК Артикул,
	               |	ВТ_ТаблицаАртикулов.Наименование КАК Наименование,
				   //|	ВТ_ТаблицаАртикулов.Цена * ЕСТЬNULL(ВТ_Коэффициент.Коэффициент, 0) / 100 + ВТ_ТаблицаАртикулов.Цена КАК Цена, 
				   ////////////////////////////////////////////////////////////////
				   // ОМГ
				   |	ВТ_ТаблицаАртикулов.Цена * ЕСТЬNULL(ВТ_Коэффициент.Коэффициент, 1)  КАК Цена, 
				   // ОМГ
				    ////////////////////////////////////////////////////////////////
	               |	ЕСТЬNULL(Номенклатура.Ссылка, НЕОПРЕДЕЛЕНО) КАК Номенклатура,
	               |	ВТ_ТаблицаАртикулов.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ТаблицаАртикулов.Цена КАК омг_ИсходнаяЦена,
	               |	ВТ_Коэффициент.Коэффициент КАК омг_Коэффициент
	               |ИЗ
	               |	ВТ_ТаблицаАртикулов КАК ВТ_ТаблицаАртикулов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО (ВЫБОР
	               |				КОГДА ВТ_ТаблицаАртикулов.Артикул = Номенклатура.Артикул
	               |					ТОГДА ИСТИНА
	               |				КОГДА ВТ_ТаблицаАртикулов.Наименование = Номенклатура.Наименование
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Коэффициент КАК ВТ_Коэффициент
	               |		ПО (ИСТИНА)";
	Запрос.УстановитьПараметр("ТаблицаАртикулов", ТаблицаАртикулов);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.омг_Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Номенклатура = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Строка документа """ + Выборка.НомерСтроки + 
				""", не найдена номенклатура по артикулу """ + Выборка.Артикул;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = Объект.Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Асинх Процедура омг_ЗагрузитьЦеныПоТарификатору(Команда)
	
	ДиалогВыбораФайла = НовыЙ ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл цен";
	ДиалогВыбораФайла.Фильтр = "Excel|*.xls;*.xlsx";
	Результат = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ПутьКФайлу = Результат[0];
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл. Подробности:
		|" + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	Начало = Ждать ВвестиЗначениеАсинх(1, "Выберите начало", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0,ДопустимыйЗнак.Неотрицательный));
	
	Если Не ЗначениеЗаполнено(Начало) Тогда
		Возврат;
	КонецЕсли;
	
	Конец = Ждать ВвестиЗначениеАсинх(1, "Выберите конец", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0,ДопустимыйЗнак.Неотрицательный));
	
	Если Не ЗначениеЗаполнено(Конец) И Не Конец = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ПутьКФайлу);
	
	
	омг_ЗагрузитьЦеныПоТарификторуНаСервере(ДвоичныеДанные, Начало, Конец, Файл.Расширение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура омг_УстановитьПометкуЗаполненностиНабора(Объект)
	
	Для Каждого СтрокаТаблицы Из Объект.Номенклатура Цикл
		
		НайденныеПозиции = Объект.омг_НоменклатураНаборов.НайтиСтроки(Новый Структура("Набор", СтрокаТаблицы.Номенклатура));
		
		СтрокаТаблицы.омг_НаборУстановлен = Не НайденныеПозиции.Количество() = 0;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПослеВыбораНоменклатурыНабора(МассивПозиций, ДопПараметры) Экспорт
	
	Если МассивПозиций = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДаннные = Элементы.Номенклатура.ТекущиеДанные;
	
	ТекущиеДаннные.омг_НаборУстановлен = МассивПозиций.Количество() > 0;
	
	НайденныеПозиции = Объект.омг_НоменклатураНаборов.НайтиСтроки(Новый Структура("Набор", ТекущиеДаннные.Номенклатура));
	
	Для Каждого СтрокаТаблицы Из НайденныеПозиции Цикл
		Объект.омг_НоменклатураНаборов.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из МассивПозиций Цикл
		ЗаполнитьЗначенияСвойств(Объект.омг_НоменклатураНаборов.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
	ТекущиеДаннные.Цена = 0;
	
	Для Каждого СтрокаТаблицы Из МассивПозиций Цикл 
		Если не ЗначениеЗаполнено(СтрокаТаблицы.ВложенныйНабор) Тогда
			Количество = 1;
			Если СтрокаТаблицы.Свойство("Количество") Тогда
				Количество = СтрокаТаблицы.Количество;
			КонецЕсли;
			ТекущиеДаннные.Цена = ТекущиеДаннные.Цена + СтрокаТаблицы.ЦенаВНаборе * Количество;  
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоКомплектующих(Набор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НоменклатураКомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	|	НоменклатураКомплектующиеНоменклатуры.Количество КАК Количество
	|ИЗ
	|	Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	|ГДЕ
	|	НоменклатураКомплектующиеНоменклатуры.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Набор);
	Выборка = Запрос.Выполнить().Выбрать();

	Соответсвие = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Соответсвие.Вставить(Выборка.Комплектующая, Выборка.Количество);
	КонецЦикла;
	
	Возврат Соответсвие;
	
КонецФункции

&НаКлиенте
Процедура НоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Элемент.ТекущийЭлемент = Элементы.Номенклатураомг_НоменклатураНабора Тогда
				
		ТекущиеДанныеНабора = Элементы.Номенклатура.ТекущиеДанные;
		
		Филиалы = Новый СписокЗначений;
		Для Каждого СтрокаТаблицы Из Объект.омг_Филиалы Цикл
			Филиалы.Добавить(СтрокаТаблицы.Филиал);
		КонецЦикла;
		
		ПараметрыПодбора = Новый Структура("Филиалы, Набор, МассивПозиций", 
			Филиалы, ТекущиеДанныеНабора.Номенклатура, Новый Массив);
			
		НайденныеПозиции = Объект.омг_НоменклатураНаборов.НайтиСтроки(Новый Структура("Набор", ТекущиеДанныеНабора.Номенклатура)); 
		
		//Для каждого подстрокаНоменклатура из НайденныеПозиции Цикл
		//	
		//	Если подстрокаНоменклатура.Номенклатура.ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Набор") Тогда
		//	НайденныеПозиции	
		//	КонецЕсли;
		//	
		//КонецЦикла	
		
		КоличествоКомплектующих = ПолучитьКоличествоКомплектующих(ТекущиеДанныеНабора.Номенклатура);
		
		Для Каждого СтрокаТаблицы Из НайденныеПозиции Цикл
			
			СтруктураСтроки = Новый Структура("Номенклатура, ЦенаВНаборе, ЦенаОбщая, Коэффициент, ВложенныйНабор, Количество");
			КоличествоКомлектующей = КоличествоКомплектующих.Получить(СтрокаТаблицы.Номенклатура);
			Если Не КоличествоКомлектующей = Неопределено Тогда
				СтруктураСтроки.Количество = КоличествоКомлектующей;
			Иначе
				СтруктураСтроки.Количество = 1;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТаблицы);
			ПараметрыПодбора.МассивПозиций.Добавить(СтруктураСтроки);
		КонецЦикла;
		
		ОбработчикПослеВыбора = Новый ОписаниеОповещения("омг_ПослеВыбораНоменклатурыНабора", ЭтаФорма);
		
		ОткрытьФорму("Документ.УстановкаЦен.Форма.омг_ФормаПодбораНоменклатурыНабора", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор,,,
			ОбработчикПослеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура омг_НоменклатураПередУдалением(Элемент, Отказ)
	
	ТекущиеДанныеНабора = Элементы.Номенклатура.ТекущиеДанные;
	НайденныеПозиции = Объект.омг_НоменклатураНаборов.НайтиСтроки(Новый Структура("Набор", ТекущиеДанныеНабора.Номенклатура));
	Для Каждого СтрокаТаблицы Из НайденныеПозиции Цикл
		Объект.омг_НоменклатураНаборов.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////
// ОМГ 

&НаКлиенте
Процедура НоменклатураПослеУдаления(Элемент)
	МассивКомплектующихБезНабора = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.омг_НоменклатураНаборов Цикл 
		
		НайденныеПозиции = Объект.Номенклатура.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТаблицы.Набор));
		Если НайденныеПозиции.Количество() = 0 Тогда
		МассивКомплектующихБезНабора.Добавить(СтрокаТаблицы);
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из МассивКомплектующихБезНабора Цикл
		Объект.омг_НоменклатураНаборов.Удалить(СтрокаТаблицы);
	КонецЦикла;

	

КонецПроцедуры  

&НаКлиенте
Процедура омг_ПерезаполнениеЦен(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ОткрытьФорму("Обработка.омг_ПроверкаИПерезаполнениеЦенПродажПоСтраховымПрограммам.Форма.Форма", , ЭтаФорма, УникальныйИдентификатор,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// ОМГ
///////////////////////////////////////////////////////////////////////////
#КонецОбласти
